#### Terraform Plan Results 📊

**Drift Detection**: ✅ No drift detected

**Plan Summary**:
```
Plan: 56 to add, 0 to change, 0 to destroy.
```

<details><summary>Show Full Plan Output</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # aws_cloudwatch_log_group.container_insights[0] will be created
  + resource "aws_cloudwatch_log_group" "container_insights" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/containerinsights/claude-demo-eks-dev/performance"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "Name" = "claude-demo-eks-dev-container-insights"
        }
      + tags_all          = {
          + "BackupPolicy"    = "daily"
          + "Compliance"      = "AWS-Well-Architected"
          + "CostCenter"      = "engineering"
          + "DataClass"       = "internal"
          + "DriftDetection"  = "enabled"
          + "Environment"     = "dev"
          + "IaCRepo"         = "https://github.com/Tejasks16/claude-demo"
          + "ManagedBy"       = "Terraform"
          + "Name"            = "claude-demo-eks-dev-container-insights"
          + "Owner"           = "tejas"
          + "Project"         = "claude-demo"
          + "SecurityZone"    = "private"
          + "TerraformModule" = "terraform-aws-modules/eks/aws"
        }
    }

  # aws_kms_alias.eks[0] will be created
  + resource "aws_kms_alias" "eks" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/claude-demo-eks-dev-eks"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # aws_kms_key.eks[0] will be created
  + resource "aws_kms_key" "eks" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 30
      + description                        = "KMS key for EKS cluster claude-demo-eks-dev envelope encryption"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "Name" = "claude-demo-eks-dev-eks-encryption-key"
        }
      + tags_all                           = {
          + "BackupPolicy"    = "daily"
          + "Compliance"      = "AWS-Well-Architected"
          + "CostCenter"      = "engineering"
          + "DataClass"       = "internal"
          + "DriftDetection"  = "enabled"
          + "Environment"     = "dev"
          + "IaCRepo"         = "https://github.com/Tejasks16/claude-demo"
          + "ManagedBy"       = "Terraform"
          + "Name"            = "claude-demo-eks-dev-eks-encryption-key"
          + "Owner"           = "tejas"
          + "Project"         = "claude-demo"
          + "SecurityZone"    = "private"
          + "TerraformModule" = "terraform-aws-modules/eks/aws"
        }
    }

  # aws_security_group.additional will be created
  + resource "aws_security_group" "additional" {
      + arn                    = (known after apply)
      + description            = "Additional security group for EKS nodes with strict controls"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "claude-demo-eks-dev-additional"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "claude-demo-eks-dev-additional-sg"
        }
      + tags_all               = {
          + "BackupPolicy"    = "daily"
          + "Compliance"      = "AWS-Well-Architected"
          + "CostCenter"      = "engineering"
          + "DataClass"       = "internal"
          + "DriftDetection"  = "enabled"
          + "Environment"     = "dev"
          + "IaCRepo"         = "https://github.com/Tejasks16/claude-demo"
          + "ManagedBy"       = "Terraform"
          + "Name"            = "claude-demo-eks-dev-additional-sg"
          + "Owner"           = "tejas"
          + "Project"         = "claude-demo"
          + "SecurityZone"    = "private"
          + "TerraformModule" = "terraform-aws-modules/eks/aws"
        }
      + vpc_id                 = (known after apply)
    }

  # module.ebs_csi_irsa_role[0].aws_iam_policy.ebs_csi[0] will be created
  + resource "aws_iam_policy" "ebs_csi" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Provides permissions to manage EBS volumes via the container storage interface driver"
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "AmazonEKS_EBS_CSI_Policy-"
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:DescribeVolumesModifications",
                          + "ec2:DescribeVolumes",
                          + "ec2:DescribeTags",
                          + "ec2:DescribeSnapshots",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeAvailabilityZones",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:ModifyVolume",
                          + "ec2:CreateSnapshot",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ec2:*:*:volume/*"
                    },
                  + {
                      + Action   = [
                          + "ec2:DetachVolume",
                          + "ec2:AttachVolume",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ec2:*:*:volume/*",
                          + "arn:aws:ec2:*:*:instance/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "ec2:EnableFastSnapshotRestores",
                          + "ec2:CreateVolume",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ec2:*:*:snapshot/*"
                    },
                  + {
                      + Action    = "ec2:CreateTags"
                      + Condition = {
                          + StringEquals = {
                              + "ec2:CreateAction" = [
                                  + "CreateVolume",
                                  + "CreateSnapshot",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:ec2:*:*:volume/*",
                          + "arn:aws:ec2:*:*:snapshot/*",
                        ]
                    },
                  + {
                      + Action   = "ec2:DeleteTags"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ec2:*:*:volume/*",
                          + "arn:aws:ec2:*:*:snapshot/*",
                        ]
                    },
                  + {
                      + Action    = "ec2:CreateVolume"
                      + Condition = {
                          + StringLike = {
                              + "aws:RequestTag/ebs.csi.aws.com/cluster" = "true"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:volume/*"
                    },
                  + {
                      + Action    = "ec2:CreateVolume"
                      + Condition = {
                          + StringLike = {
                              + "aws:RequestTag/CSIVolumeName" = "*"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:volume/*"
                    },
                  + {
                      + Action    = "ec2:DeleteVolume"
                      + Condition = {
                          + StringLike = {
                              + "aws:ResourceTag/ebs.csi.aws.com/cluster" = "true"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:volume/*"
                    },
                  + {
                      + Action    = "ec2:DeleteVolume"
                      + Condition = {
                          + StringLike = {
                              + "aws:ResourceTag/CSIVolumeName" = "*"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:volume/*"
                    },
                  + {
                      + Action    = "ec2:DeleteVolume"
                      + Condition = {
                          + StringLike = {
                              + "ec2:ResourceTag/kubernetes.io/created-for/pvc/name" = "*"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:volume/*"
                    },
                  + {
                      + Action    = "ec2:CreateSnapshot"
                      + Condition = {
                          + StringLike = {
                              + "aws:RequestTag/CSIVolumeSnapshotName" = "*"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:snapshot/*"
                    },
                  + {
                      + Action    = "ec2:CreateSnapshot"
                      + Condition = {
                          + StringLike = {
                              + "aws:RequestTag/ebs.csi.aws.com/cluster" = "true"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:snapshot/*"
                    },
                  + {
                      + Action    = "ec2:DeleteSnapshot"
                      + Condition = {
                          + StringLike = {
                              + "aws:ResourceTag/CSIVolumeSnapshotName" = "*"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:snapshot/*"
                    },
                  + {
                      + Action    = "ec2:DeleteSnapshot"
                      + Condition = {
                          + StringLike = {
                              + "aws:ResourceTag/ebs.csi.aws.com/cluster" = "true"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:snapshot/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "Name" = "claude-demo-eks-dev-ebs-csi-irsa-role"
        }
      + tags_all         = {
          + "BackupPolicy"    = "daily"
          + "Compliance"      = "AWS-Well-Architected"
          + "CostCenter"      = "engineering"
          + "DataClass"       = "internal"
          + "DriftDetection"  = "enabled"
          + "Environment"     = "dev"
          + "IaCRepo"         = "https://github.com/Tejasks16/claude-demo"
          + "ManagedBy"       = "Terraform"
          + "Name"            = "claude-demo-eks-dev-ebs-csi-irsa-role"
          + "Owner"           = "tejas"
          + "Project"         = "claude-demo"
          + "SecurityZone"    = "private"
          + "TerraformModule" = "terraform-aws-modules/eks/aws"
        }
    }

  # module.eks.aws_cloudwatch_log_group.this[0] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/eks/claude-demo-eks-dev/cluster"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "ClusterName" = "claude-demo-eks-dev"
          + "Name"        = "/aws/eks/claude-demo-eks-dev/cluster"
        }
      + tags_all          = {
          + "BackupPolicy"    = "daily"
          + "ClusterName"     = "claude-demo-eks-dev"
          + "Compliance"      = "AWS-Well-Architected"
          + "CostCenter"      = "engineering"
          + "DataClass"       = "internal"
          + "DriftDetection"  = "enabled"
          + "Environment"     = "dev"
          + "IaCRepo"         = "https://github.com/Tejasks16/claude-demo"
          + "ManagedBy"       = "Terraform"
          + "Name"            = "/aws/eks/claude-demo-eks-dev/cluster"
          + "Owner"           = "tejas"
          + "Project"         = "claude-demo"
          + "SecurityZone"    = "private"
          + "TerraformModule" = "terraform-aws-modules/eks/aws"
        }
    }

  # module.eks.aws_iam_policy.custom[0] will be created
  + resource "aws_iam_policy" "custom" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "claude-demo-eks-dev-cluster-"
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ec2:RunInstances",
                          + "ec2:CreateLaunchTemplate",
                          + "ec2:CreateFleet",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "aws:RequestTag/eks:eks-cluster-name" = "${aws:PrincipalTag/eks:eks-cluster-name}"
                            }
                          + StringLike   = {
                              + "aws:RequestTag/eks:kubernetes-node-class-name" = "*"
                              + "aws:RequestTag/eks:kubernetes-node-pool-name"  = "*"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = "Compute"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateVolume",
                          + "ec2:CreateSnapshot",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "aws:RequestTag/eks:eks-cluster-name" = "${aws:PrincipalTag/eks:eks-cluster-name}"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:ec2:*:*:volume/*",
                          + "arn:aws:ec2:*:*:snapshot/*",
                        ]
                      + Sid       = "Storage"
                    },
                  + {
                      + Action    = "ec2:CreateNetworkInterface"
                      + Condition = {
                          + StringEquals = {
                              + "aws:RequestTag/eks:eks-cluster-name"         = "${aws:PrincipalTag/eks:eks-cluster-name}"
                              + "aws:RequestTag/eks:kubernetes-cni-node-name" = "*"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = "Networking"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:CreateTargetGroup",
                          + "elasticloadbalancing:CreateRule",
                          + "elasticloadbalancing:CreateLoadBalancer",
                          + "elasticloadbalancing:CreateListener",
                          + "ec2:CreateSecurityGroup",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "aws:RequestTag/eks:eks-cluster-name" = "${aws:PrincipalTag/eks:eks-cluster-name}"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = "LoadBalancer"
                    },
                  + {
                      + Action    = "shield:CreateProtection"
                      + Condition = {
                          + StringEquals = {
                              + "aws:RequestTag/eks:eks-cluster-name" = "${aws:PrincipalTag/eks:eks-cluster-name}"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = "ShieldProtection"
                    },
                  + {
                      + Action    = "shield:TagResource"
                      + Condition = {
                          + StringEquals = {
                              + "aws:RequestTag/eks:eks-cluster-name" = "${aws:PrincipalTag/eks:eks-cluster-name}"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:shield::*:protection/*"
                      + Sid       = "ShieldTagResource"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "ClusterName" = "claude-demo-eks-dev"
        }
      + tags_all         = {
          + "BackupPolicy"    = "daily"
          + "ClusterName"     = "claude-demo-eks-dev"
          + "Compliance"      = "AWS-Well-Architected"
          + "CostCenter"      = "engineering"
          + "DataClass"       = "internal"
          + "DriftDetection"  = "enabled"
          + "Environment"     = "dev"
          + "IaCRepo"         = "https://github.com/Tejasks16/claude-demo"
          + "ManagedBy"       = "Terraform"
          + "Owner"           = "tejas"
          + "Project"         = "claude-demo"
          + "SecurityZone"    = "private"
          + "TerraformModule" = "terraform-aws-modules/eks/aws"
        }
    }

  # module.eks.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "sts:TagSession",
                          + "sts:AssumeRole",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                      + Sid       = "EKSClusterAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "claude-demo-eks-dev-cluster-"
      + path                  = "/"
      + tags                  = {
          + "ClusterName" = "claude-demo-eks-dev"
        }
      + tags_all              = {
          + "BackupPolicy"    = "daily"
          + "ClusterName"     = "claude-demo-eks-dev"
          + "Compliance"      = "AWS-Well-Architected"
          + "CostCenter"      = "engineering"
          + "DataClass"       = "internal"
          + "DriftDetection"  = "enabled"
          + "Environment"     = "dev"
          + "IaCRepo"         = "https://github.com/Tejasks16/claude-demo"
          + "ManagedBy"       = "Terraform"
          + "Owner"           = "tejas"
          + "Project"         = "claude-demo"
          + "SecurityZone"    = "private"
          + "TerraformModule" = "terraform-aws-modules/eks/aws"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.custom[0] will be created
  + resource "aws_iam_role_policy_attachment" "custom" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = (known after apply)
    }

  # module.eks.aws_security_group.cluster[0] will be created
  + resource "aws_security_group" "cluster" {
      + arn                    = (known after apply)
      + description            = "EKS cluster security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "claude-demo-eks-dev-cluster-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "ClusterName" = "claude-demo-eks-dev"
          + "Name"        = "claude-demo-eks-dev-cluster"
        }
      + tags_all               = {
          + "BackupPolicy"    = "daily"
          + "ClusterName"     = "claude-demo-eks-dev"
          + "Compliance"      = "AWS-Well-Architected"
          + "CostCenter"      = "engineering"
          + "DataClass"       = "internal"
          + "DriftDetection"  = "enabled"
          + "Environment"     = "dev"
          + "IaCRepo"         = "https://github.com/Tejasks16/claude-demo"
          + "ManagedBy"       = "Terraform"
          + "Name"            = "claude-demo-eks-dev-cluster"
          + "Owner"           = "tejas"
          + "Project"         = "claude-demo"
          + "SecurityZone"    = "private"
          + "TerraformModule" = "terraform-aws-modules/eks/aws"
        }
      + vpc_id                 = (known after apply)
    }

  # module.eks.aws_security_group.node[0] will be created
  + resource "aws_security_group" "node" {
      + arn                    = (known after apply)
      + description            = "EKS node shared security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "claude-demo-eks-dev-node-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "ClusterName"                               = "claude-demo-eks-dev"
          + "Name"                                      = "claude-demo-eks-dev-node"
          + "kubernetes.io/cluster/claude-demo-eks-dev" = "owned"
        }
      + tags_all               = {
          + "BackupPolicy"                              = "daily"
          + "ClusterName"                               = "claude-demo-eks-dev"
          + "Compliance"                                = "AWS-Well-Architected"
          + "CostCenter"                                = "engineering"
          + "DataClass"                                 = "internal"
          + "DriftDetection"                            = "enabled"
          + "Environment"                               = "dev"
          + "IaCRepo"                                   = "https://github.com/Tejasks16/claude-demo"
          + "ManagedBy"                                 = "Terraform"
          + "Name"                                      = "claude-demo-eks-dev-node"
          + "Owner"                                     = "tejas"
          + "Project"                                   = "claude-demo"
          + "SecurityZone"                              = "private"
          + "TerraformModule"                           = "terraform-aws-modules/eks/aws"
          + "kubernetes.io/cluster/claude-demo-eks-dev" = "owned"
        }
      + vpc_id                 = (known after apply)
    }

  # module.eks.aws_security_group_rule.cluster["ingress_nodes_443"] will be created
  + resource "aws_security_group_rule" "cluster" {
      + description              = "Node groups to cluster API"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.cluster["ingress_nodes_ephemeral_ports_tcp"] will be created
  + resource "aws_security_group_rule" "cluster" {
      + description              = "Nodes on ephemeral ports"
      + from_port                = 1025
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["egress_all"] will be created
  + resource "aws_security_group_rule" "node" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Node all egress"
      + from_port                = 0
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_443"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node groups"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node 4443/tcp webhook"
      + from_port                = 4443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 4443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node 6443/tcp webhook"
      + from_port                = 6443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 6443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node 8443/tcp webhook"
      + from_port                = 8443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node 9443/tcp webhook"
      + from_port                = 9443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 9443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_all"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster to node all ports/protocols"
      + from_port                = 0
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node kubelets"
      + from_port                = 10250
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 10250
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node ingress on ephemeral ports"
      + from_port                = 1025
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_self_all"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node all ports/protocols"
      + from_port                = 0
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS"
      + from_port                = 53
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS UDP"
      + from_port                = 53
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "udp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "ingress"
    }

  # module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "vpc_flow_log_cloudwatch" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:DescribeLogGroups",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AWSVPCFlowLogsPushToCloudWatch"
        }
    }

  # module.vpc.aws_cloudwatch_log_group.flow_log[0] will be created
  + resource "aws_cloudwatch_log_group" "flow_log" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = (known after apply)
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "Name" = "claude-demo-eks-dev-vpc"
        }
      + tags_all          = {
          + "BackupPolicy"    = "daily"
          + "Compliance"      = "AWS-Well-Architected"
          + "CostCenter"      = "engineering"
          + "DataClass"       = "internal"
          + "DriftDetection"  = "enabled"
          + "Environment"     = "dev"
          + "IaCRepo"         = "https://github.com/Tejasks16/claude-demo"
          + "ManagedBy"       = "Terraform"
          + "Name"            = "claude-demo-eks-dev-vpc"
          + "Owner"           = "tejas"
          + "Project"         = "claude-demo"
          + "SecurityZone"    = "private"
          + "TerraformModule" = "terraform-aws-modules/eks/aws"
        }
    }

  # module.vpc.aws_default_network_acl.this[0] will be created
  + resource "aws_default_network_acl" "this" {
      + arn                    = (known after apply)
      + default_network_acl_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + tags                   = {
          + "Name" = "claude-demo-eks-dev-vpc"
        }
      + tags_all               = {
          + "BackupPolicy"    = "daily"
          + "Compliance"      = "AWS-Well-Architected"
          + "CostCenter"      = "engineering"
          + "DataClass"       = "internal"
          + "DriftDetection"  = "enabled"
          + "Environment"     = "dev"
          + "IaCRepo"         = "https://github.com/Tejasks16/claude-demo"
          + "ManagedBy"       = "Terraform"
          + "Name"            = "claude-demo-eks-dev-vpc"
          + "Owner"           = "tejas"
          + "Project"         = "claude-demo"
          + "SecurityZone"    = "private"
          + "TerraformModule" = "terraform-aws-modules/eks/aws"
        }
      + vpc_id                 = (known after apply)

      + egress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
      + egress {
          + action          = "allow"
          + cidr_block      = "0.0.0.0/0"
          + from_port       = 0
          + protocol        = "-1"
          + rule_no         = 100
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }

      + ingress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
      + ingress {
          + action          = "allow"
          + cidr_block      = "0.0.0.0/0"
          + from_port       = 0
          + protocol        = "-1"
          + rule_no         = 100
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
    }

  # module.vpc.aws_default_route_table.default[0] will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = (known after apply)
      + tags                   = {
          + "Name" = "claude-demo-eks-dev-vpc"
        }
      + tags_all               = {
          + "BackupPolicy"    = "daily"
          + "Compliance"      = "AWS-Well-Architected"
          + "CostCenter"      = "engineering"
          + "DataClass"       = "internal"
          + "DriftDetection"  = "enabled"
          + "Environment"     = "dev"
          + "IaCRepo"         = "https://github.com/Tejasks16/claude-demo"
          + "ManagedBy"       = "Terraform"
          + "Name"            = "claude-demo-eks-dev-vpc"
          + "Owner"           = "tejas"
          + "Project"         = "claude-demo"
          + "SecurityZone"    = "private"
          + "TerraformModule" = "terraform-aws-modules/eks/aws"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "5m"
          + update = "5m"
        }
    }

  # module.vpc.aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "claude-demo-eks-dev-vpc"
        }
      + tags_all               = {
          + "BackupPolicy"    = "daily"
          + "Compliance"      = "AWS-Well-Architected"
          + "CostCenter"      = "engineering"
          + "DataClass"       = "internal"
          + "DriftDetection"  = "enabled"
          + "Environment"     = "dev"
          + "IaCRepo"         = "https://github.com/Tejasks16/claude-demo"
          + "ManagedBy"       = "Terraform"
          + "Name"            = "claude-demo-eks-dev-vpc"
          + "Owner"           = "tejas"
          + "Project"         = "claude-demo"
          + "SecurityZone"    = "private"
          + "TerraformModule" = "terraform-aws-modules/eks/aws"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "claude-demo-eks-dev-vpc"
        }
      + tags_all             = {
          + "BackupPolicy"    = "daily"
          + "Compliance"      = "AWS-Well-Architected"
          + "CostCenter"      = "engineering"
          + "DataClass"       = "internal"
          + "DriftDetection"  = "enabled"
          + "Environment"     = "dev"
          + "IaCRepo"         = "https://github.com/Tejasks16/claude-demo"
          + "ManagedBy"       = "Terraform"
          + "Name"            = "claude-demo-eks-dev-vpc"
          + "Owner"           = "tejas"
          + "Project"         = "claude-demo"
          + "SecurityZone"    = "private"
          + "TerraformModule" = "terraform-aws-modules/eks/aws"
        }
      + vpc                  = (known after apply)
    }

  # module.vpc.aws_flow_log.this[0] will be created
  + resource "aws_flow_log" "this" {
      + arn                      = (known after apply)
      + iam_role_arn             = (known after apply)
      + id                       = (known after apply)
      + log_destination          = (known after apply)
      + log_destination_type     = "cloud-watch-logs"
      + log_format               = (known after apply)
      + log_group_name           = (known after apply)
      + max_aggregation_interval = 600
      + tags                     = {
          + "Name" = "claude-demo-eks-dev-vpc"
        }
      + tags_all                 = {
          + "BackupPolicy"    = "daily"
          + "Compliance"      = "AWS-Well-Architected"
          + "CostCenter"      = "engineering"
          + "DataClass"       = "internal"
          + "DriftDetection"  = "enabled"
          + "Environment"     = "dev"
          + "IaCRepo"         = "https://github.com/Tejasks16/claude-demo"
          + "ManagedBy"       = "Terraform"
          + "Name"            = "claude-demo-eks-dev-vpc"
          + "Owner"           = "tejas"
          + "Project"         = "claude-demo"
          + "SecurityZone"    = "private"
          + "TerraformModule" = "terraform-aws-modules/eks/aws"
        }
      + traffic_type             = "ALL"
      + vpc_id                   = (known after apply)
    }

  # module.vpc.aws_iam_policy.vpc_flow_log_cloudwatch[0] will be created
  + resource "aws_iam_policy" "vpc_flow_log_cloudwatch" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "vpc-flow-log-to-cloudwatch-"
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "Name" = "claude-demo-eks-dev-vpc"
        }
      + tags_all         = {
          + "BackupPolicy"    = "daily"
          + "Compliance"      = "AWS-Well-Architected"
          + "CostCenter"      = "engineering"
          + "DataClass"       = "internal"
          + "DriftDetection"  = "enabled"
          + "Environment"     = "dev"
          + "IaCRepo"         = "https://github.com/Tejasks16/claude-demo"
          + "ManagedBy"       = "Terraform"
          + "Name"            = "claude-demo-eks-dev-vpc"
          + "Owner"           = "tejas"
          + "Project"         = "claude-demo"
          + "SecurityZone"    = "private"
          + "TerraformModule" = "terraform-aws-modules/eks/aws"
        }
    }

  # module.vpc.aws_iam_role.vpc_flow_log_cloudwatch[0] will be created
  + resource "aws_iam_role" "vpc_flow_log_cloudwatch" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "vpc-flow-logs.amazonaws.com"
                        }
                      + Sid       = "AWSVPCFlowLogsAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "vpc-flow-log-role-"
      + path                  = "/"
      + tags                  = {
          + "Name" = "claude-demo-eks-dev-vpc"
        }
      + tags_all              = {
          + "BackupPolicy"    = "daily"
          + "Compliance"      = "AWS-Well-Architected"
          + "CostCenter"      = "engineering"
          + "DataClass"       = "internal"
          + "DriftDetection"  = "enabled"
          + "Environment"     = "dev"
          + "IaCRepo"         = "https://github.com/Tejasks16/claude-demo"
          + "ManagedBy"       = "Terraform"
          + "Name"            = "claude-demo-eks-dev-vpc"
          + "Owner"           = "tejas"
          + "Project"         = "claude-demo"
          + "SecurityZone"    = "private"
          + "TerraformModule" = "terraform-aws-modules/eks/aws"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.vpc.aws_iam_role_policy_attachment.vpc_flow_log_cloudwatch[0] will be created
  + resource "aws_iam_role_policy_attachment" "vpc_flow_log_cloudwatch" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "claude-demo-eks-dev-vpc"
        }
      + tags_all = {
          + "BackupPolicy"    = "daily"
          + "Compliance"      = "AWS-Well-Architected"
          + "CostCenter"      = "engineering"
          + "DataClass"       = "internal"
          + "DriftDetection"  = "enabled"
          + "Environment"     = "dev"
          + "IaCRepo"         = "https://github.com/Tejasks16/claude-demo"
          + "ManagedBy"       = "Terraform"
          + "Name"            = "claude-demo-eks-dev-vpc"
          + "Owner"           = "tejas"
          + "Project"         = "claude-demo"
          + "SecurityZone"    = "private"
          + "TerraformModule" = "terraform-aws-modules/eks/aws"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "claude-demo-eks-dev-vpc"
        }
      + tags_all                           = {
          + "BackupPolicy"    = "daily"
          + "Compliance"      = "AWS-Well-Architected"
          + "CostCenter"      = "engineering"
          + "DataClass"       = "internal"
          + "DriftDetection"  = "enabled"
          + "Environment"     = "dev"
          + "IaCRepo"         = "https://github.com/Tejasks16/claude-demo"
          + "ManagedBy"       = "Terraform"
          + "Name"            = "claude-demo-eks-dev-vpc"
          + "Owner"           = "tejas"
          + "Project"         = "claude-demo"
          + "SecurityZone"    = "private"
          + "TerraformModule" = "terraform-aws-modules/eks/aws"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "claude-demo-eks-dev-vpc"
        }
      + tags_all         = {
          + "BackupPolicy"    = "daily"
          + "Compliance"      = "AWS-Well-Architected"
          + "CostCenter"      = "engineering"
          + "DataClass"       = "internal"
          + "DriftDetection"  = "enabled"
          + "Environment"     = "dev"
          + "IaCRepo"         = "https://github.com/Tejasks16/claude-demo"
          + "ManagedBy"       = "Terraform"
          + "Name"            = "claude-demo-eks-dev-vpc"
          + "Owner"           = "tejas"
          + "Project"         = "claude-demo"
          + "SecurityZone"    = "private"
          + "TerraformModule" = "terraform-aws-modules/eks/aws"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "claude-demo-eks-dev-vpc"
        }
      + tags_all         = {
          + "BackupPolicy"    = "daily"
          + "Compliance"      = "AWS-Well-Architected"
          + "CostCenter"      = "engineering"
          + "DataClass"       = "internal"
          + "DriftDetection"  = "enabled"
          + "Environment"     = "dev"
          + "IaCRepo"         = "https://github.com/Tejasks16/claude-demo"
          + "ManagedBy"       = "Terraform"
          + "Name"            = "claude-demo-eks-dev-vpc"
          + "Owner"           = "tejas"
          + "Project"         = "claude-demo"
          + "SecurityZone"    = "private"
          + "TerraformModule" = "terraform-aws-modules/eks/aws"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                                      = "claude-demo-eks-dev-vpc"
          + "kubernetes.io/cluster/claude-demo-eks-dev" = "shared"
          + "kubernetes.io/role/internal-elb"           = "1"
        }
      + tags_all                                       = {
          + "BackupPolicy"                              = "daily"
          + "Compliance"                                = "AWS-Well-Architected"
          + "CostCenter"                                = "engineering"
          + "DataClass"                                 = "internal"
          + "DriftDetection"                            = "enabled"
          + "Environment"                               = "dev"
          + "IaCRepo"                                   = "https://github.com/Tejasks16/claude-demo"
          + "ManagedBy"                                 = "Terraform"
          + "Name"                                      = "claude-demo-eks-dev-vpc"
          + "Owner"                                     = "tejas"
          + "Project"                                   = "claude-demo"
          + "SecurityZone"                              = "private"
          + "TerraformModule"                           = "terraform-aws-modules/eks/aws"
          + "kubernetes.io/cluster/claude-demo-eks-dev" = "shared"
          + "kubernetes.io/role/internal-elb"           = "1"
        }
      

... (truncated, see artifacts for full plan)
```

</details>

**Plan Status**: `failure`

---

**Next Steps**:
- Review the plan carefully
- Check for any unexpected changes
- If approved, merge this PR to auto-apply changes

*Pushed by: @Tejasks16*
*Workflow: `Terraform PR Validation`*
*Run ID: `23255367096`*